HloModule jit_add, entry_computation_layout={(u32[]{:T(128)}, s32[]{:T(128)})->u32[]{:T(128)}}, allow_spmd_sharding_propagation_to_parameters={true,true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.5 (x.1: u32[], y.2: s32[]) -> u32[] {
  %x.1 = u32[] parameter(0), metadata={op_name="x"}
  %y.2 = s32[] parameter(1), metadata={op_name="y"}
  %convert_element_type.3 = u32[] convert(%y.2), metadata={op_name="jit(add)/convert_element_type" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/flax/nnx/rnglib.py" source_line=77 source_end_line=77 source_column=4 source_end_column=24}
  ROOT %add.4 = u32[] add(%x.1, %convert_element_type.3), metadata={op_name="jit(add)/add" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/flax/nnx/rnglib.py" source_line=77 source_end_line=77 source_column=4 source_end_column=24}
}

