HloModule jit_convert_element_type, is_scheduled=true, entry_computation_layout={(u32[]{:T(128)})->u32[]{:T(128)}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.2 (args_0_.1: u32[]) -> u32[] {
  %args_0_.1 = u32[]{:T(128)} parameter(0), metadata={op_name="args[0]"}
  %copy.1 = u32[]{:T(128)S(6)} copy(%args_0_.1)
  ROOT %copy = u32[]{:T(128)} copy(%copy.1)
}

