HloModule jit__threefry_seed, entry_computation_layout={(s32[])->u32[2]{0}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.1 (seed.1: s32[]) -> u32[2] {
  %seed.1 = s32[] parameter(0), metadata={op_name="seed"}
  %constant.1 = s32[] constant(32)
  %shift_right_logical.1 = s32[] shift-right-logical(%seed.1, %constant.1), metadata={op_name="jit(_threefry_seed)/shift_right_logical" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py" source_line=358 source_end_line=358 source_column=16 source_end_column=64}
  %convert_element_type.2 = u32[] convert(%shift_right_logical.1), metadata={op_name="jit(_threefry_seed)/convert_element_type" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py" source_line=358 source_end_line=358 source_column=16 source_end_column=64}
  %broadcast_in_dim.2 = u32[1]{0} reshape(%convert_element_type.2), metadata={op_name="jit(_threefry_seed)/broadcast_in_dim" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py" source_line=358 source_end_line=358 source_column=16 source_end_column=64}
  %convert_element_type.3 = u32[] convert(%seed.1), metadata={op_name="jit(_threefry_seed)/convert_element_type" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py" source_line=358 source_end_line=358 source_column=16 source_end_column=64}
  %broadcast_in_dim.3 = u32[1]{0} reshape(%convert_element_type.3), metadata={op_name="jit(_threefry_seed)/broadcast_in_dim" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py" source_line=358 source_end_line=358 source_column=16 source_end_column=64}
  ROOT %concatenate.1 = u32[2]{0} concatenate(%broadcast_in_dim.2, %broadcast_in_dim.3), dimensions={0}, metadata={op_name="jit(_threefry_seed)/concatenate" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py" source_line=358 source_end_line=358 source_column=16 source_end_column=64}
}

