HloModule jit_slice, entry_computation_layout={(bf16[3456]{0})->bf16[1152]{0}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.1 (args_0_.1: bf16[3456]) -> bf16[1152] {
  %args_0_.1 = bf16[3456]{0} parameter(0), metadata={op_name="args[0]"}
  ROOT %slice.1 = bf16[1152]{0} slice(%args_0_.1), slice={[0:1152]}, metadata={op_name="jit(slice)/slice" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/linear_common.py" source_line=63 source_end_line=66 source_column=23 source_end_column=53}
}

