#loc1 = loc("seed")
module @jit__threefry_seed attributes {mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<i32> loc("seed")) -> (tensor<2xui32> {jax.result_info = "result"}) {
    %c = stablehlo.constant dense<-1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<32> : tensor<i32> loc(#loc)
    %0 = stablehlo.shift_right_logical %arg0, %c_0 : tensor<i32> loc(#loc31)
    %1 = stablehlo.convert %0 : (tensor<i32>) -> tensor<ui32> loc(#loc32)
    %2 = stablehlo.broadcast_in_dim %1, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc33)
    %3 = stablehlo.and %arg0, %c : tensor<i32> loc(#loc34)
    %4 = stablehlo.convert %3 : (tensor<i32>) -> tensor<ui32> loc(#loc32)
    %5 = stablehlo.broadcast_in_dim %4, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc33)
    %6 = stablehlo.concatenate %2, %5, dim = 0 : (tensor<1xui32>, tensor<1xui32>) -> tensor<2xui32> loc(#loc35)
    return %6 : tensor<2xui32> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc = loc(unknown)
#loc2 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/runner/tpu_jax_runner.py":147:23 to :61)
#loc3 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/runner/tpu_jax_runner.py":107:8 to :27)
#loc4 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/worker/tpu_worker_jax.py":143:28 to :74)
#loc5 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/v1/worker/worker_base.py":332:12 to :37)
#loc6 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/utils/__init__.py":2977:11 to :32)
#loc7 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/executor/uniproc_executor.py":74:20 to :72)
#loc8 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/executor/uniproc_executor.py":47:8 to :42)
#loc9 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/executor/executor_base.py":54:8 to :29)
#loc10 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/v1/engine/core.py":105:30 to :57)
#loc11 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/v1/engine/core.py":555:12 to 557:13)
#loc12 = loc("TPUModelRunner._init_random"(#loc2))
#loc13 = loc("TPUModelRunner.__init__"(#loc3))
#loc14 = loc("TPUWorker.init_device"(#loc4))
#loc15 = loc("WorkerWrapperBase.init_device"(#loc5))
#loc16 = loc("run_method"(#loc6))
#loc17 = loc("UniProcExecutor.collective_rpc"(#loc7))
#loc18 = loc("UniProcExecutor._init_executor"(#loc8))
#loc19 = loc("ExecutorBase.__init__"(#loc9))
#loc20 = loc("EngineCore.__init__"(#loc10))
#loc21 = loc("EngineCoreProc.__init__"(#loc11))
#loc22 = loc(callsite(#loc20 at #loc21))
#loc23 = loc(callsite(#loc19 at #loc22))
#loc24 = loc(callsite(#loc18 at #loc23))
#loc25 = loc(callsite(#loc17 at #loc24))
#loc26 = loc(callsite(#loc16 at #loc25))
#loc27 = loc(callsite(#loc15 at #loc26))
#loc28 = loc(callsite(#loc14 at #loc27))
#loc29 = loc(callsite(#loc13 at #loc28))
#loc30 = loc(callsite(#loc12 at #loc29))
#loc31 = loc("jit(_threefry_seed)/shift_right_logical"(#loc30))
#loc32 = loc("jit(_threefry_seed)/convert_element_type"(#loc30))
#loc33 = loc("jit(_threefry_seed)/broadcast_in_dim"(#loc30))
#loc34 = loc("jit(_threefry_seed)/and"(#loc30))
#loc35 = loc("jit(_threefry_seed)/concatenate"(#loc30))
