#loc1 = loc("args[0]")
module @jit_slice attributes {mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<1152x1152xbf16> loc("args[0]")) -> (tensor<1152x1152xbf16> {jax.result_info = "result"}) {
    %0 = stablehlo.slice %arg0 [0:1152, 0:1152] : (tensor<1152x1152xbf16>) -> tensor<1152x1152xbf16> loc(#loc31)
    return %0 : tensor<1152x1152xbf16> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc = loc(unknown)
#loc2 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/linear_common.py":63:23 to 66:53)
#loc3 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/linear_common.py":131:17 to 132:48)
#loc4 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/quantization/unquantized.py":78:17 to 85:9)
#loc5 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/model_executor/model_loader/utils.py":117:16 to :66)
#loc6 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/model_executor/model_loader/base_loader.py":56:12 to :77)
#loc7 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/model_executor/model_loader/__init__.py":130:11 to :80)
#loc8 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/models/vllm/vllm_model_wrapper.py":118:25 to :73)
#loc9 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/models/common/model_loader.py":291:27 to :47)
#loc10 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/models/common/model_loader.py":322:19 to :57)
#loc11 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/runner/tpu_jax_runner.py":293:222 to 297:9)
#loc12 = loc("reorder_concatenated_tensor_for_sharding"(#loc2))
#loc13 = loc("torch_to_jax_param"(#loc3))
#loc14 = loc("VllmUnquantizedLinearMethod.process_weights_after_loading"(#loc4))
#loc15 = loc("process_weights_after_loading"(#loc5))
#loc16 = loc("BaseModelLoader.load_model"(#loc6))
#loc17 = loc("get_model"(#loc7))
#loc18 = loc("VllmModelWrapper.load_weights"(#loc8))
#loc19 = loc("get_vllm_model"(#loc9))
#loc20 = loc("get_model"(#loc10))
#loc21 = loc("TPUModelRunner.load_model"(#loc11))
#loc22 = loc(callsite(#loc20 at #loc21))
#loc23 = loc(callsite(#loc19 at #loc22))
#loc24 = loc(callsite(#loc18 at #loc23))
#loc25 = loc(callsite(#loc17 at #loc24))
#loc26 = loc(callsite(#loc16 at #loc25))
#loc27 = loc(callsite(#loc15 at #loc26))
#loc28 = loc(callsite(#loc14 at #loc27))
#loc29 = loc(callsite(#loc13 at #loc28))
#loc30 = loc(callsite(#loc12 at #loc29))
#loc31 = loc("jit(slice)/slice"(#loc30))
