HloModule jit__threefry_seed, is_scheduled=true, entry_computation_layout={(s32[])->u32[2]{0}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

%fused_computation (param_0.1: s32[]) -> u32[2] {
  %param_0.1 = s32[] parameter(0)
  %constant.0 = s32[] constant(32)
  %shift_right_logical.0 = s32[] shift-right-logical(%param_0.1, %constant.0), metadata={op_name="jit(_threefry_seed)/shift_right_logical" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py" source_line=358 source_end_line=358 source_column=16 source_end_column=64}
  %convert_element_type.1 = u32[] convert(%shift_right_logical.0), metadata={op_name="jit(_threefry_seed)/convert_element_type" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py" source_line=358 source_end_line=358 source_column=16 source_end_column=64}
  %bitcast.3 = u32[1]{0} bitcast(%convert_element_type.1), metadata={op_name="jit(_threefry_seed)/convert_element_type" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py" source_line=358 source_end_line=358 source_column=16 source_end_column=64}
  %convert_element_type.0 = u32[] convert(%param_0.1), metadata={op_name="jit(_threefry_seed)/convert_element_type" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py" source_line=358 source_end_line=358 source_column=16 source_end_column=64}
  %bitcast.2 = u32[1]{0} bitcast(%convert_element_type.0), metadata={op_name="jit(_threefry_seed)/convert_element_type" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py" source_line=358 source_end_line=358 source_column=16 source_end_column=64}
  ROOT %concatenate.0 = u32[2]{0} concatenate(%bitcast.3, %bitcast.2), dimensions={0}, metadata={op_name="jit(_threefry_seed)/concatenate" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py" source_line=358 source_end_line=358 source_column=16 source_end_column=64}
}

ENTRY %main.1 (seed.1: s32[]) -> u32[2] {
  %seed.1 = s32[] parameter(0), metadata={op_name="seed"}
  ROOT %bitcast_concatenate_fusion = u32[2]{0} fusion(%seed.1), kind=kLoop, calls=%fused_computation, metadata={op_name="jit(_threefry_seed)/concatenate" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py" source_line=358 source_end_line=358 source_column=16 source_end_column=64}
}

