HloModule jit_concatenate, is_scheduled=true, entry_computation_layout={(bf16[128,4,192,2048]{3,2,1,0}, bf16[128,4,192,2048]{3,2,1,0})->bf16[128,4,384,2048]{3,2,1,0}}, allow_spmd_sharding_propagation_to_parameters={true,true}, allow_spmd_sharding_propagation_to_output={true}

%fused_computation (param_0.2: bf16[128,4,192,2048], param_1.2: bf16[128,4,192,2048]) -> bf16[128,4,384,2048] {
  %param_1.2 = bf16[128,4,192,2048]{3,2,1,0} parameter(1)
  %convert.5 = f32[128,4,192,2048]{3,2,1,0} convert(%param_1.2)
  %param_0.2 = bf16[128,4,192,2048]{3,2,1,0} parameter(0)
  %convert.4 = f32[128,4,192,2048]{3,2,1,0} convert(%param_0.2)
  %concatenate.0 = f32[128,4,384,2048]{3,2,1,0} concatenate(%convert.5, %convert.4), dimensions={2}, metadata={op_name="jit(concatenate)/concatenate" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/linear_common.py" source_line=71 source_end_line=71 source_column=23 source_end_column=67}
  ROOT %convert.3 = bf16[128,4,384,2048]{3,2,1,0} convert(%concatenate.0)
}

ENTRY %main.1 (args_0_.1: bf16[128,4,192,2048], args_1_.1: bf16[128,4,192,2048]) -> bf16[128,4,384,2048] {
  %args_0_.1 = bf16[128,4,192,2048]{3,2,1,0} parameter(0), metadata={op_name="args[0]"}
  %args_1_.1 = bf16[128,4,192,2048]{3,2,1,0} parameter(1), metadata={op_name="args[1]"}
  ROOT %concatenate_convert_fusion = bf16[128,4,384,2048]{3,2,1,0} fusion(%args_1_.1, %args_0_.1), kind=kLoop, calls=%fused_computation, backend_config={"outer_dimension_partitions":["14"]}
}

