HloModule jit__multi_slice, entry_computation_layout={(bf16[1152,4304]{1,0})->(bf16[1152,1076]{1,0}, bf16[1152,1076]{1,0}, bf16[1152,1076]{1,0}, bf16[1152,1076]{1,0})}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true,true,true,true}

ENTRY %main.1 (self.1: bf16[1152,4304]) -> (bf16[1152,1076], bf16[1152,1076], bf16[1152,1076], bf16[1152,1076]) {
  %self.1 = bf16[1152,4304]{1,0} parameter(0), metadata={op_name="self"}
  %slice.4 = bf16[1152,1076]{1,0} slice(%self.1), slice={[0:1152], [0:1076]}, metadata={op_name="jit(_multi_slice)/slice" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/linear_common.py" source_line=133 source_end_line=133 source_column=17 source_end_column=49}
  %slice.5 = bf16[1152,1076]{1,0} slice(%self.1), slice={[0:1152], [1076:2152]}, metadata={op_name="jit(_multi_slice)/slice" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/linear_common.py" source_line=133 source_end_line=133 source_column=17 source_end_column=49}
  %slice.6 = bf16[1152,1076]{1,0} slice(%self.1), slice={[0:1152], [2152:3228]}, metadata={op_name="jit(_multi_slice)/slice" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/linear_common.py" source_line=133 source_end_line=133 source_column=17 source_end_column=49}
  %slice.7 = bf16[1152,1076]{1,0} slice(%self.1), slice={[0:1152], [3228:4304]}, metadata={op_name="jit(_multi_slice)/slice" source_file="/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/linear_common.py" source_line=133 source_end_line=133 source_column=17 source_end_column=49}
  ROOT %tuple.1 = (bf16[1152,1076]{1,0}, bf16[1152,1076]{1,0}, bf16[1152,1076]{1,0}, bf16[1152,1076]{1,0}) tuple(%slice.4, %slice.5, %slice.6, %slice.7)
}

