#loc1 = loc("self")
module @jit__multi_slice attributes {mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  sdy.mesh @empty_mesh = <[]> loc(#loc)
  func.func public @main(%arg0: tensor<152064x2048xbf16> {sdy.sharding = #sdy.sharding<@empty_mesh, [{}, {}]>} loc("self")) -> (tensor<38016x2048xbf16> {jax.result_info = "result[0]"}, tensor<38016x2048xbf16> {jax.result_info = "result[1]"}, tensor<38016x2048xbf16> {jax.result_info = "result[2]"}, tensor<38016x2048xbf16> {jax.result_info = "result[3]"}) {
    %0 = stablehlo.slice %arg0 [0:38016, 0:2048] : (tensor<152064x2048xbf16>) -> tensor<38016x2048xbf16> loc(#loc31)
    %1 = stablehlo.slice %arg0 [38016:76032, 0:2048] : (tensor<152064x2048xbf16>) -> tensor<38016x2048xbf16> loc(#loc31)
    %2 = stablehlo.slice %arg0 [76032:114048, 0:2048] : (tensor<152064x2048xbf16>) -> tensor<38016x2048xbf16> loc(#loc31)
    %3 = stablehlo.slice %arg0 [114048:152064, 0:2048] : (tensor<152064x2048xbf16>) -> tensor<38016x2048xbf16> loc(#loc31)
    return %0, %1, %2, %3 : tensor<38016x2048xbf16>, tensor<38016x2048xbf16>, tensor<38016x2048xbf16>, tensor<38016x2048xbf16> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc = loc(unknown)
#loc2 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/sharding.py":72:22 to :54)
#loc3 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/sharding.py":82:13 to 83:60)
#loc4 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/sharding.py":150:16 to :43)
#loc5 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/sharding.py":41:8 to :41)
#loc6 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/models/vllm/vllm_model_wrapper.py":133:29 to :70)
#loc7 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/models/common/model_loader.py":291:27 to :47)
#loc8 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/models/common/model_loader.py":322:19 to :57)
#loc9 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/runner/tpu_jax_runner.py":293:222 to 297:9)
#loc10 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/worker/tpu_worker_jax.py":229:8 to :38)
#loc11 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/utils/__init__.py":2977:11 to :32)
#loc12 = loc("_convert_to_torchax_and_shard"(#loc2))
#loc13 = loc("_shard_vocab_parallel_embedding"(#loc3))
#loc14 = loc("_shard_module_to_tpu"(#loc4))
#loc15 = loc("shard_model_to_tpu"(#loc5))
#loc16 = loc("VllmModelWrapper.load_weights"(#loc6))
#loc17 = loc("get_vllm_model"(#loc7))
#loc18 = loc("get_model"(#loc8))
#loc19 = loc("TPUModelRunner.load_model"(#loc9))
#loc20 = loc("TPUWorker.load_model"(#loc10))
#loc21 = loc("run_method"(#loc11))
#loc22 = loc(callsite(#loc20 at #loc21))
#loc23 = loc(callsite(#loc19 at #loc22))
#loc24 = loc(callsite(#loc18 at #loc23))
#loc25 = loc(callsite(#loc17 at #loc24))
#loc26 = loc(callsite(#loc16 at #loc25))
#loc27 = loc(callsite(#loc15 at #loc26))
#loc28 = loc(callsite(#loc14 at #loc27))
#loc29 = loc(callsite(#loc13 at #loc28))
#loc30 = loc(callsite(#loc12 at #loc29))
#loc31 = loc("jit(_multi_slice)/slice"(#loc30))
