#loc1 = loc("seed")
module @jit__threefry_seed attributes {mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<i32> loc("seed")) -> (tensor<2xui32> {jax.result_info = "result"}) {
    %c = stablehlo.constant dense<32> : tensor<i32> loc(#loc)
    %0 = stablehlo.shift_right_logical %arg0, %c : tensor<i32> loc(#loc31)
    %1 = stablehlo.convert %0 : (tensor<i32>) -> tensor<ui32> loc(#loc32)
    %2 = stablehlo.broadcast_in_dim %1, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc33)
    %c_0 = stablehlo.constant dense<-1> : tensor<i32> loc(#loc)
    %3 = stablehlo.and %arg0, %c_0 : tensor<i32> loc(#loc34)
    %4 = stablehlo.convert %3 : (tensor<i32>) -> tensor<ui32> loc(#loc32)
    %5 = stablehlo.broadcast_in_dim %4, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc33)
    %6 = stablehlo.concatenate %2, %5, dim = 0 : (tensor<1xui32>, tensor<1xui32>) -> tensor<2xui32> loc(#loc35)
    return %6 : tensor<2xui32> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc = loc(unknown)
#loc2 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/tensor.py":358:16 to :64)
#loc3 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/__init__.py":38:10 to :30)
#loc4 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/interop.py":186:28 to :49)
#loc5 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/linear_common.py":134:35 to :53)
#loc6 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/quantization/unquantized.py":78:17 to 85:9)
#loc7 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/model_executor/model_loader/utils.py":117:16 to :66)
#loc8 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/model_executor/model_loader/base_loader.py":56:12 to :77)
#loc9 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/model_executor/model_loader/__init__.py":130:11 to :80)
#loc10 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/models/vllm/vllm_model_wrapper.py":118:25 to :73)
#loc11 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/models/common/model_loader.py":291:27 to :47)
#loc12 = loc("Environment.__init__"(#loc2))
#loc13 = loc("default_env"(#loc3))
#loc14 = loc("_torch_view"(#loc4))
#loc15 = loc("torch_to_jax_param"(#loc5))
#loc16 = loc("VllmUnquantizedLinearMethod.process_weights_after_loading"(#loc6))
#loc17 = loc("process_weights_after_loading"(#loc7))
#loc18 = loc("BaseModelLoader.load_model"(#loc8))
#loc19 = loc("get_model"(#loc9))
#loc20 = loc("VllmModelWrapper.load_weights"(#loc10))
#loc21 = loc("get_vllm_model"(#loc11))
#loc22 = loc(callsite(#loc20 at #loc21))
#loc23 = loc(callsite(#loc19 at #loc22))
#loc24 = loc(callsite(#loc18 at #loc23))
#loc25 = loc(callsite(#loc17 at #loc24))
#loc26 = loc(callsite(#loc16 at #loc25))
#loc27 = loc(callsite(#loc15 at #loc26))
#loc28 = loc(callsite(#loc14 at #loc27))
#loc29 = loc(callsite(#loc13 at #loc28))
#loc30 = loc(callsite(#loc12 at #loc29))
#loc31 = loc("jit(_threefry_seed)/shift_right_logical"(#loc30))
#loc32 = loc("jit(_threefry_seed)/convert_element_type"(#loc30))
#loc33 = loc("jit(_threefry_seed)/broadcast_in_dim"(#loc30))
#loc34 = loc("jit(_threefry_seed)/and"(#loc30))
#loc35 = loc("jit(_threefry_seed)/concatenate"(#loc30))
