#loc1 = loc("x")
#loc2 = loc("y")
module @jit_add attributes {mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<ui32> loc("x"), %arg1: tensor<i32> loc("y")) -> (tensor<ui32> {jax.result_info = "result"}) {
    %0 = stablehlo.convert %arg1 : (tensor<i32>) -> tensor<ui32> loc(#loc32)
    %1 = stablehlo.add %arg0, %0 : tensor<ui32> loc(#loc33)
    return %1 : tensor<ui32> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc = loc(unknown)
#loc3 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/flax/nnx/rnglib.py":77:4 to :24)
#loc4 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/runner/tpu_jax_runner.py":304:52 to :60)
#loc5 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/worker/tpu_worker_jax.py":229:8 to :38)
#loc6 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/utils/__init__.py":2977:11 to :32)
#loc7 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/executor/uniproc_executor.py":74:20 to :72)
#loc8 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/executor/uniproc_executor.py":48:8 to :41)
#loc9 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/executor/executor_base.py":54:8 to :29)
#loc10 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/v1/engine/core.py":105:30 to :57)
#loc11 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/v1/engine/core.py":555:12 to 557:13)
#loc12 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/vllm/v1/engine/core.py":783:30 to :61)
#loc13 = loc("RngStream.__call__"(#loc3))
#loc14 = loc("TPUModelRunner.load_model"(#loc4))
#loc15 = loc("TPUWorker.load_model"(#loc5))
#loc16 = loc("run_method"(#loc6))
#loc17 = loc("UniProcExecutor.collective_rpc"(#loc7))
#loc18 = loc("UniProcExecutor._init_executor"(#loc8))
#loc19 = loc("ExecutorBase.__init__"(#loc9))
#loc20 = loc("EngineCore.__init__"(#loc10))
#loc21 = loc("EngineCoreProc.__init__"(#loc11))
#loc22 = loc("EngineCoreProc.run_engine_core"(#loc12))
#loc23 = loc(callsite(#loc21 at #loc22))
#loc24 = loc(callsite(#loc20 at #loc23))
#loc25 = loc(callsite(#loc19 at #loc24))
#loc26 = loc(callsite(#loc18 at #loc25))
#loc27 = loc(callsite(#loc17 at #loc26))
#loc28 = loc(callsite(#loc16 at #loc27))
#loc29 = loc(callsite(#loc15 at #loc28))
#loc30 = loc(callsite(#loc14 at #loc29))
#loc31 = loc(callsite(#loc13 at #loc30))
#loc32 = loc("jit(add)/convert_element_type"(#loc31))
#loc33 = loc("jit(add)/add"(#loc31))
