#loc1 = loc("args[0]")
module @jit_convert_element_type attributes {mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<480xf32> loc("args[0]")) -> (tensor<480xbf16> {jax.result_info = "result"}) {
    %0 = stablehlo.convert %arg0 : (tensor<480xf32>) -> tensor<480xbf16> loc(#loc31)
    return %0 : tensor<480xbf16> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc = loc(unknown)
#loc2 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torchax/ops/mappings.py":46:12 to :57)
#loc3 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/sharding.py":71:17 to :28)
#loc4 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/sharding.py":77:11 to :74)
#loc5 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/sharding.py":48:27 to :72)
#loc6 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torch/utils/_pytree.py":1498:23 to :30)
#loc7 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torch/utils/_pytree.py":1197:21 to :33)
#loc8 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torch/utils/_pytree.py":1380:11 to :52)
#loc9 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/torch/utils/_pytree.py":1568:11 to :81)
#loc10 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/layers/vllm/sharding.py":46:26 to 49:30)
#loc11 = loc("/home/eporat/benchmarking_qwen_omni_tpu/.venv/lib/python3.11/site-packages/tpu_inference/models/vllm/vllm_model_wrapper.py":133:29 to :70)
#loc12 = loc("t2j"(#loc2))
#loc13 = loc("_convert_to_torchax_and_shard"(#loc3))
#loc14 = loc("_shard_tensor_to_tpu_replicated"(#loc4))
#loc15 = loc("shard_model_to_tpu.<locals>.<lambda>"(#loc5))
#loc16 = loc("map_only.<locals>.wrapper.<locals>.wrapped"(#loc6))
#loc17 = loc("TreeSpec.unflatten"(#loc7))
#loc18 = loc("tree_map"(#loc8))
#loc19 = loc("tree_map_only"(#loc9))
#loc20 = loc("shard_model_to_tpu"(#loc10))
#loc21 = loc("VllmModelWrapper.load_weights"(#loc11))
#loc22 = loc(callsite(#loc20 at #loc21))
#loc23 = loc(callsite(#loc19 at #loc22))
#loc24 = loc(callsite(#loc18 at #loc23))
#loc25 = loc(callsite(#loc17 at #loc24))
#loc26 = loc(callsite(#loc16 at #loc25))
#loc27 = loc(callsite(#loc15 at #loc26))
#loc28 = loc(callsite(#loc14 at #loc27))
#loc29 = loc(callsite(#loc13 at #loc28))
#loc30 = loc(callsite(#loc12 at #loc29))
#loc31 = loc("jit(convert_element_type)/convert_element_type"(#loc30))
